In [3]:
import pandas as pd

casts = pd.read_csv('data/cast.csv',index_col=None)
casts.head # head is used to show first five records

titles = pd.read_csv('data/titles.csv', index_col =None)
titles.tail() # tail is used to show last five records

                      title  year
49995                 Rebel  1970
49996               Suzanne  1996
49997                 Bomba  2013
49998  Aao Jao Ghar Tumhara  1984
49999            Mrs. Munck  1995

In [4]:
'''
read_csv : read the data from the csv file.
index_col = None : there is no index i.e. first column is data
head() : show only first five elements of the DataFrame
tail() : show only last five elements of the DataFrame
'''

'\nread_csv : read the data from the csv file.\nindex_col = None : there is no index i.e. first column is data\nhead() : show only first five elements of the DataFrame\ntail() : show only last five elements of the DataFrame\n'

In [5]:
titles

                         title  year
0               The Rising Son  1990
1      The Thousand Plane Raid  1969
2             Crucea de piatra  1993
3                      Country  2000
4                   Gaiking II  2011
...                        ...   ...
49995                    Rebel  1970
49996                  Suzanne  1996
49997                    Bomba  2013
49998     Aao Jao Ghar Tumhara  1984
49999               Mrs. Munck  1995

[50000 rows x 2 columns]

In [6]:
len(titles) # titles give total number of rows

50000

In [7]:
t = titles['title']
t

0                 The Rising Son
1        The Thousand Plane Raid
2               Crucea de piatra
3                        Country
4                     Gaiking II
                  ...
49995                      Rebel
49996                    Suzanne
49997                      Bomba
49998       Aao Jao Ghar Tumhara
49999                 Mrs. Munck
Name: title, Length: 50000, dtype: object

In [13]:
#ix : use ‘loc’ command to select a row from the DataFrame.
titles.loc[1]

title    The Thousand Plane Raid
year                        1969
Name: 1, dtype: object

In [18]:
# filter data
'''
Data can be filtered by providing some boolean expression in DataFrame.
For example, in below code, movies which released after 1985 are filtered out from
the DataFrame ‘titles’ and stored in a new DataFrame i.e. after85.'''
# movies after 1985
after85 =titles[titles['year'] > 1985]
after85.head()

              title  year
0    The Rising Son  1990
2  Crucea de piatra  1993
3           Country  2000
4        Gaiking II  2011
5       Medusa (IV)  2015

In [ ]:
'''
In below code all the movies in decade 1990 (i.e. 1900-1999) are selected.
Also ‘t = titles’ is used for simplicity purpose only.
'''

In [17]:
# display movie in years 1990 - 1999
t = titles
movies90 = t[ (t['year']>=1990) & (t['year']<2000) ]
movies90.head()

                       title  year
0             The Rising Son  1990
2           Crucea de piatra  1993
12  Poka Makorer Ghar Bosoti  1996
19          Maa Durga Shakti  1999
24      Conflict of Interest  1993

In [29]:
# find all movies named as 'Macbeth'
t = titles
macbeth = t[t['title'] == 'Macbeth']
macbeth

         title  year
4226   Macbeth  1913
9322   Macbeth  2006
11722  Macbeth  2013
17166  Macbeth  1997
25847  Macbeth  1998

In [30]:
macbeth = t[t['title'] == 'Macbeth']
macbeth

C:\Users\mvign\AppData\Local\Temp\ipykernel_3484\1483441140.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.sort_index will be keyword-only.
  macbeth = t[t['title'] == 'Macbeth'].sort_index(1)

         title  year
4226   Macbeth  1913
9322   Macbeth  2006
11722  Macbeth  2013
17166  Macbeth  1997
25847  Macbeth  1998

In [31]:
#sorting the vlaues based on year
macbeth = t[t['title'] == 'Macbeth'].sort_values('year')
macbeth

         title  year
4226   Macbeth  1913
17166  Macbeth  1997
25847  Macbeth  1998
9322   Macbeth  2006
11722  Macbeth  2013